import numpy as np

a = np.array([[1, 3, 5, 7, 9, 11, 13],
            [2, 4, 6, 8, 10, 12, 14],
            [3, 5, 7, 9, 11, 13, 15],
            [2, 4, 6, 8, 10, 12, 14],
            [1, 3, 5, 7, 9, 11, 13]])

print(np.max(a)) #最大値

'''
15
'''

print(np.amax(a)) #最大値

'''
15
'''

print(a.max()) #最大値

'''
15
'''

print(np.maximum(a, 6)) #ブロードキャストつき maximum

'''
[[ 6  6  6  7  9 11 13]
 [ 6  6  6  8 10 12 14]
 [ 6  6  7  9 11 13 15]
 [ 6  6  6  8 10 12 14]
 [ 6  6  6  7  9 11 13]]
'''

print(np.argmax(a)) #最大値をとるインデックス（1 次元 array に引き伸ばされている）

'''
20
'''